# Четене на входните числа
start = int(input())
end = int(input())

# Цикли по всяка цифра от баркода (хиляди, стотици, десетици, единици)
for i in range(start // 1000, (end // 1000) + 1):
    for j in range((start // 100) % 10, (end // 100) % 10 + 1):
        for k in range((start // 10) % 10, (end // 10) % 10 + 1):
            for l in range(start % 10, end % 10 + 1):
                # Проверяваме дали всичките цифри са нечетни
                if i % 2 != 0 and j % 2 != 0 and k % 2 != 0 and l % 2 != 0:
                    # Отпечатваме числото, ако е съставено само от нечетни цифри
                    print(f"{i}{j}{k}{l}", end=" ")
